Evsdrg/ESP32-wifiUART/src/main.cpp
    form.baudRate.addEventListener('input', () => {
      const baudRate = String(form.baudRate.value);
      baudRatePresetEl.value = commonBaudRates.includes(baudRate) ? baudRate : 'custom';
    });

    function openHelpModal(title, text) {
      helpModalTitleEl.textContent = title;
      helpModalTextEl.textContent = text;
      helpModalEl.classList.add('open');
      helpModalEl.setAttribute('aria-hidden', 'false');
    }

    function closeHelpModal() {
      helpModalEl.classList.remove('open');
      helpModalEl.setAttribute('aria-hidden', 'true');
    }

    helpButtons.forEach((button) => {
      button.addEventListener('click', () => {
        const title = button.dataset.helpTitle || '说明';
        const text = button.dataset.helpText || '';
        openHelpModal(title, text);
      });
    });

    helpModalCloseEl.addEventListener('click', closeHelpModal);
    helpModalEl.addEventListener('click', (event) => {
      if (event.target === helpModalEl) {
        closeHelpModal();
      }
    });
    window.addEventListener('keydown', (event) => {
      if (event.key === 'Escape' && helpModalEl.classList.contains('open')) {
        closeHelpModal();
      }
    });

    async function refresh() {
      const response = await fetch('/api/uart');
      if (!response.ok) {
        throw new Error('读取当前串口参数失败');
      }
      const data = await response.json();
      renderCurrent(data);
    }

    function profileCard(profile) {
      const active = profile.active ? '当前启用' : '已保存';
      return `
        <div class="profile">
          <div class="profile-title">槽位 ${profile.index} - ${profile.ssid}</div>
          <div class="profile-meta">${active}</div>
          <div class="profile-actions">
            <button type="button" data-action="activate" data-index="${profile.index}">启用</button>
            <button type="button" data-action="delete" data-index="${profile.index}">删除</button>
          </div>
        </div>`;
    }

    function renderWiFi(data) {
      const modeText = data.apActive ? 'AP 模式' : (data.connected ? 'STA 模式' : '空闲');
      const activeText = data.activeIndex >= 0 ? `槽位 ${data.activeIndex}` : '无';
      const connectedText = data.connectedSsid || '无';
      const ipText = data.ip || '不可用';
      wifiCurrentEl.textContent =
        `当前模式: ${modeText} | 启用槽位: ${activeText} | 已连 Wi‑Fi: ${connectedText} | IP 地址: ${ipText}`;

      if (!data.profiles.length) {
        profilesEl.innerHTML = '<div class="subtle">当前还没有保存任何 Wi-Fi 配置。</div>';
      } else {
        profilesEl.innerHTML = data.profiles.map(profileCard).join('');
      }
    }

    function renderScanResults(data) {
      if (!data.networks.length) {
        scanResultsEl.innerHTML = '<div class="subtle">没有扫描到可见热点。</div>';
        return;
      }

      const sortedNetworks = [...data.networks].sort((left, right) => right.rssi - left.rssi);
      scanResultsEl.innerHTML = sortedNetworks.map((network) => `
        <div class="scan-item" data-ssid="${network.ssid}" data-open="${network.open ? '1' : '0'}">
          <div class="scan-title">${network.ssid || '<hidden>'}</div>
          <div class="scan-meta">信号: ${network.rssi} dBm | 信道: ${network.channel} | 安全: ${network.security}</div>
        </div>
      `).join('');
    }

    function updatePasswordHint(isOpenNetwork) {
      wifiPasswordHintEl.textContent = isOpenNetwork
        ? '已选择开放网络，可以不填写密码。'
        : '密码留空仅适用于开放网络，或保留当前槽位已保存的密码。';
    }

    async function refreshWiFi() {
      const response = await fetch('/api/wifi');
      if (!response.ok) {
        throw new Error('读取 Wi-Fi 配置失败');
      }
      const data = await response.json();
      renderWiFi(data);
    }

    async function postForm(url, params) {
      const response = await fetch(url, {
        method: 'POST',
        headers: { 'Content-Type': 'application/x-www-form-urlencoded' },
        body: params.toString(),
      });
      const data = await response.json();
      if (!response.ok) {
        throw new Error(data.error || '请求失败');
      }
      await refreshWiFi();
      return data;
    }

    form.addEventListener('submit', async (event) => {
      event.preventDefault();
      statusEl.textContent = '正在应用串口参数...';
      const params = new URLSearchParams(new FormData(form));
      try {
        const response = await fetch('/api/uart', {
          method: 'POST',
          headers: { 'Content-Type': 'application/x-www-form-urlencoded' },
          body: params.toString(),
        });
        const data = await response.json();
        if (!response.ok) {
          throw new Error(data.error || '更新失败');
        }
        renderCurrent(data);
        statusEl.textContent = '串口参数已更新。';
      } catch (error) {
        statusEl.textContent = error.message;
      }
    });

    wifiForm.addEventListener('submit', async (event) => {
      event.preventDefault();
      wifiStatusEl.textContent = '正在保存 Wi-Fi 配置...';
      try {
        await postForm('/api/wifi/save', new URLSearchParams(new FormData(wifiForm)));
        wifiStatusEl.textContent = 'Wi-Fi 配置已保存。';
      } catch (error) {
        wifiStatusEl.textContent = error.message;
      }
    });

    profilesEl.addEventListener('click', async (event) => {
      const button = event.target.closest('button[data-action]');
      if (!button) {
        return;
      }
      const index = button.dataset.index;
      const action = button.dataset.action;
      wifiStatusEl.textContent = `${action === 'activate' ? '正在启用' : '正在删除'} Wi-Fi 配置...`;
      try {
        const params = new URLSearchParams();
        params.set('index', index);
        await postForm(action === 'activate' ? '/api/wifi/activate' : '/api/wifi/delete', params);
        wifiStatusEl.textContent = action === 'activate' ? 'Wi-Fi 配置已启用。' : 'Wi-Fi 配置已删除。';
      } catch (error) {
        wifiStatusEl.textContent = error.message;
      }
    });

    scanResultsEl.addEventListener('click', (event) => {
      const item = event.target.closest('.scan-item[data-ssid]');
      if (!item) {
        return;
      }
      const ssid = item.dataset.ssid;
      const isOpenNetwork = item.dataset.open === '1';
      wifiForm.ssid.value = ssid;
      if (isOpenNetwork) {
        wifiForm.password.value = '';
      }
      wifiForm.activate.value = '1';
      updatePasswordHint(isOpenNetwork);
      wifiStatusEl.textContent = `已选择 ${ssid || '<hidden>'} 并填入 Wi-Fi 表单。`;
    });

    scanButton.addEventListener('click', async () => {
      scanStatusEl.textContent = '正在扫描附近 Wi-Fi...';
      try {
        const response = await fetch('/api/wifi/scan', { method: 'POST' });
        const data = await response.json();
        if (!response.ok) {
          throw new Error(data.error || '扫描失败');
        }
        renderScanResults(data);
        scanStatusEl.textContent = `共扫描到 ${data.networks.length} 个热点。`;
      } catch (error) {
        scanStatusEl.textContent = error.message;
      }
    });

    refresh().catch((error) => {
      statusEl.textContent = error.message;
      currentEl.textContent = '无法读取当前串口参数。';
    });

    refreshWiFi().catch((error) => {
      wifiStatusEl.textContent = error.message;
      wifiCurrentEl.textContent = '无法读取当前 Wi-Fi 状态。';
    });
    updatePasswordHint(false);
  </script>
</body>
</html>
)HTML";

class ByteRingBuffer {
 public:
  ByteRingBuffer() = default;

  ~ByteRingBuffer() {
    release();
  }

  ByteRingBuffer(const ByteRingBuffer &) = delete;
  ByteRingBuffer &operator=(const ByteRingBuffer &) = delete;
  ByteRingBuffer(ByteRingBuffer &&) = delete;
  ByteRingBuffer &operator=(ByteRingBuffer &&) = delete;

  [[nodiscard]]
  bool begin(size_t capacity) {
    release();

    if (capacity == 0) {
      return false;
    }

    data_ = static_cast<uint8_t *>(ps_malloc(capacity));
    usingPsram_ = data_ != nullptr;
    if (data_ == nullptr) {
      data_ = static_cast<uint8_t *>(malloc(capacity));
    }

    if (data_ == nullptr) {
      capacity_ = 0;
      usingPsram_ = false;
      return false;
    }

