Evsdrg/ESP32-wifiUART/src/main.cpp
    capacity_ = capacity;
    clear();
    return true;
  }

  void release() {
    if (data_ != nullptr) {
      free(data_);
      data_ = nullptr;
    }

    capacity_ = 0;
    usingPsram_ = false;
    head_ = 0;
    tail_ = 0;
    count_ = 0;
  }

  [[nodiscard]] size_t capacity() const {
    return capacity_;
  }

  [[nodiscard]] bool usingPsram() const {
    return usingPsram_;
  }

  [[nodiscard]] size_t size() const {
    return count_;
  }

  [[nodiscard]] size_t freeSpace() const {
    return capacity_ - count_;
  }

  size_t push(const uint8_t *data, size_t length) {
    if (data_ == nullptr || capacity_ == 0) {
      return 0;
    }

    size_t written = 0;
    while (written < length && count_ < capacity_) {
      data_[head_] = data[written++];
      head_ = (head_ + 1) % capacity_;
      ++count_;
    }
    return written;
  }

  size_t peek(uint8_t *data, size_t length) const {
    if (data_ == nullptr || capacity_ == 0) {
      return 0;
    }

    const size_t available = min(length, count_);
    size_t index = tail_;
    for (size_t i = 0; i < available; ++i) {
      data[i] = data_[index];
      index = (index + 1) % capacity_;
    }
    return available;
  }

  void discard(size_t length) {
    if (capacity_ == 0) {
      return;
    }

    const size_t discarded = min(length, count_);
    tail_ = (tail_ + discarded) % capacity_;
    count_ -= discarded;
  }

  void clear() {
    head_ = 0;
    tail_ = 0;
    count_ = 0;
  }

 private:
  uint8_t *data_ = nullptr;
  size_t capacity_ = 0;
  bool usingPsram_ = false;
  size_t head_ = 0;
  size_t tail_ = 0;
  size_t count_ = 0;
};

HardwareSerial UartPort(1);
WiFiServer TcpServer(TCP_BRIDGE_PORT);
WiFiClient TcpClient;
WebServer HttpServer(kHttpPort);
Preferences PreferencesStore;
CRGB Leds[kLedCount];
ByteRingBuffer gTcpToUartBuffer;
ByteRingBuffer gUartToTcpBuffer;
UartSettings gUartSettings = {kUartBaudRate, 8, 'N', 1};
WiFiProfile gWiFiProfiles[kMaxWiFiProfiles] = {};
uint32_t gLastActivityAtMs = 0;
uint32_t gLastWifiReconnectAttemptMs = 0;
uint32_t gLastUartBackpressureLogAtMs = 0;
uint32_t gLastStatsLogAtMs = 0;
bool gUseStationMode = false;
bool gAccessPointActive = false;
bool gTcpServerStarted = false;
bool gStationWasConnected = false;
bool gTcpClientActive = false;
bool gWifiScanInProgress = false;
bool gPendingWiFiReconfigure = false;
int8_t gActiveWiFiProfileIndex = -1;
uint64_t gUartToTcpBytes = 0;
uint64_t gTcpToUartBytes = 0;
uint32_t gTcpClientConnectCount = 0;
uint32_t gTcpClientDisconnectCount = 0;
uint32_t gWifiReconnectCount = 0;
uint32_t gUartBackpressureEvents = 0;
uint32_t gUartToTcpOverflowEvents = 0;
uint32_t gTcpToUartOverflowEvents = 0;
uint32_t gTcpPartialWriteEvents = 0;
WiFiScanResult gWiFiScanResults[kMaxWiFiProfiles] = {};
size_t gWiFiScanResultCount = 0;

void clearSessionBuffers();
void showStatusLed();

void sendJsonDocument(int statusCode, JsonDocument &doc) {
  String response;
  serializeJson(doc, response);
  HttpServer.send(statusCode, "application/json", response);
}

void sendJsonError(int statusCode, const String &message) {
  JsonDocument doc;
  doc["error"] = message;
  sendJsonDocument(statusCode, doc);
}

void makeWiFiProfileKeys(uint8_t index, char *ssidKey, char *passwordKey) {
  snprintf(ssidKey, 4, "s%02u", index);
  snprintf(passwordKey, 4, "p%02u", index);
}

int countStoredWiFiProfiles() {
  int count = 0;
  for (uint8_t i = 0; i < kMaxWiFiProfiles; ++i) {
    if (gWiFiProfiles[i].inUse) {
      ++count;
    }
  }
  return count;
}

const WiFiProfile *getActiveWiFiProfile() {
  if (gActiveWiFiProfileIndex < 0 || gActiveWiFiProfileIndex >= kMaxWiFiProfiles) {
    return nullptr;
  }

  return gWiFiProfiles[gActiveWiFiProfileIndex].inUse ? &gWiFiProfiles[gActiveWiFiProfileIndex] : nullptr;
}

void persistActiveWiFiProfileIndex() {
  PreferencesStore.putUChar("aidx", gActiveWiFiProfileIndex >= 0 ? static_cast<uint8_t>(gActiveWiFiProfileIndex) : 255);
}

bool setActiveWiFiProfileIndex(int8_t index) {
  if (index < 0) {
    gActiveWiFiProfileIndex = -1;
    persistActiveWiFiProfileIndex();
    return true;
  }

  if (index >= kMaxWiFiProfiles || !gWiFiProfiles[index].inUse) {
    return false;
  }

  gActiveWiFiProfileIndex = index;
  persistActiveWiFiProfileIndex();
  return true;
}

void loadWiFiProfiles() {
  for (uint8_t i = 0; i < kMaxWiFiProfiles; ++i) {
    char ssidKey[4] = {0};
    char passwordKey[4] = {0};
    makeWiFiProfileKeys(i, ssidKey, passwordKey);
    const String ssid = PreferencesStore.isKey(ssidKey) ? PreferencesStore.getString(ssidKey, String()) : String();
    const String password = PreferencesStore.isKey(passwordKey) ? PreferencesStore.getString(passwordKey, String()) : String();
    gWiFiProfiles[i] = {!ssid.isEmpty(), ssid, password};
  }

  const uint8_t activeIndex = PreferencesStore.getUChar("aidx", 255);
  if (activeIndex < kMaxWiFiProfiles && gWiFiProfiles[activeIndex].inUse) {
    gActiveWiFiProfileIndex = static_cast<int8_t>(activeIndex);
  } else {
    gActiveWiFiProfileIndex = -1;
  }
}

bool saveWiFiProfile(uint8_t index, const String &ssid, const String &password) {
  if (index >= kMaxWiFiProfiles || ssid.isEmpty()) {
    return false;
  }

  char ssidKey[4] = {0};
  char passwordKey[4] = {0};
  makeWiFiProfileKeys(index, ssidKey, passwordKey);

  if (PreferencesStore.putString(ssidKey, ssid) == 0) {
    return false;
  }

  PreferencesStore.putString(passwordKey, password);
  gWiFiProfiles[index] = {true, ssid, password};
  return true;
}

void deleteWiFiProfile(uint8_t index) {
  if (index >= kMaxWiFiProfiles) {
    return;
  }

  char ssidKey[4] = {0};
  char passwordKey[4] = {0};
  makeWiFiProfileKeys(index, ssidKey, passwordKey);
  PreferencesStore.remove(ssidKey);
  PreferencesStore.remove(passwordKey);
  gWiFiProfiles[index] = {false, String(), String()};

  if (gActiveWiFiProfileIndex == static_cast<int8_t>(index)) {
    setActiveWiFiProfileIndex(-1);
  }
}

/**
 * @brief Seed profile slot 0 from compile-time macros when storage is empty.
 * @note Seeding is skipped if any profile already exists or WIFI_SSID is empty.
 */
void seedDefaultWiFiProfileIfNeeded() {
  if (countStoredWiFiProfiles() > 0 || strlen(WIFI_SSID) == 0) {
    return;
  }

