Evsdrg/ESP32-wifiUART/src/main.cpp
  if (saveWiFiProfile(0, WIFI_SSID, WIFI_PASSWORD)) {
    setActiveWiFiProfileIndex(0);
    debugPrintln("Seeded Wi-Fi profile slot 0 from build flags");
  }
}

bool initPreferences() {
  if (!PreferencesStore.begin("bridgecfg", false)) {
    return false;
  }

  loadWiFiProfiles();
  seedDefaultWiFiProfileIfNeeded();
  loadWiFiProfiles();
  return true;
}

void addWiFiProfilesJson(JsonDocument &doc) {
  const bool wifiConnected = WiFi.status() == WL_CONNECTED;
  const String ip = gAccessPointActive ? WiFi.softAPIP().toString() : (wifiConnected ? WiFi.localIP().toString() : String());
  doc["activeIndex"] = gActiveWiFiProfileIndex;
  doc["connected"] = wifiConnected;
  doc["apActive"] = gAccessPointActive;
  doc["connectedSsid"] = wifiConnected ? WiFi.SSID() : String();
  doc["ip"] = ip;
  JsonArray profiles = doc["profiles"].to<JsonArray>();

  for (uint8_t i = 0; i < kMaxWiFiProfiles; ++i) {
    if (!gWiFiProfiles[i].inUse) {
      continue;
    }

    JsonObject profile = profiles.add<JsonObject>();
    profile["index"] = i;
    profile["ssid"] = gWiFiProfiles[i].ssid;
    profile["active"] = gActiveWiFiProfileIndex == static_cast<int8_t>(i);
  }
}

void queueWiFiReconfigure() {
  gPendingWiFiReconfigure = true;
}

String wifiSecurityLabel(uint8_t encryptionType) {
  switch (encryptionType) {
    case WIFI_AUTH_OPEN:
      return "Open";
    case WIFI_AUTH_WEP:
      return "WEP";
    case WIFI_AUTH_WPA_PSK:
      return "WPA";
    case WIFI_AUTH_WPA2_PSK:
      return "WPA2";
    case WIFI_AUTH_WPA_WPA2_PSK:
      return "WPA/WPA2";
    case WIFI_AUTH_WPA2_ENTERPRISE:
      return "WPA2-Enterprise";
    case WIFI_AUTH_WPA3_PSK:
      return "WPA3";
    case WIFI_AUTH_WPA2_WPA3_PSK:
      return "WPA2/WPA3";
    case WIFI_AUTH_WAPI_PSK:
      return "WAPI";
    default:
      return "Unknown";
  }
}

void addWiFiScanResultsJson(JsonDocument &doc) {
  JsonArray networks = doc["networks"].to<JsonArray>();
  for (size_t i = 0; i < gWiFiScanResultCount; ++i) {
    JsonObject network = networks.add<JsonObject>();
    network["ssid"] = gWiFiScanResults[i].ssid;
    network["rssi"] = gWiFiScanResults[i].rssi;
    network["channel"] = gWiFiScanResults[i].channel;
    network["security"] = wifiSecurityLabel(gWiFiScanResults[i].encryption);
    network["open"] = gWiFiScanResults[i].encryption == WIFI_AUTH_OPEN;
  }
}

void scanNearbyWiFi() {
  gWifiScanInProgress = true;
  showStatusLed();

  if (gAccessPointActive) {
    WiFi.mode(WIFI_AP_STA);
  }

  gWiFiScanResultCount = 0;
  int16_t count = WiFi.scanNetworks(true, true);
  while (count == WIFI_SCAN_RUNNING) {
    delay(30);
    showStatusLed();
    count = WiFi.scanComplete();
  }
  if (count <= 0) {
    WiFi.scanDelete();
    if (gAccessPointActive) {
      WiFi.mode(WIFI_AP);
    }
    gWifiScanInProgress = false;
    showStatusLed();
    return;
  }

  const size_t cappedCount = min(static_cast<size_t>(count), static_cast<size_t>(kMaxWiFiProfiles));
  for (size_t i = 0; i < cappedCount; ++i) {
    gWiFiScanResults[i].ssid = WiFi.SSID(i);
    gWiFiScanResults[i].rssi = WiFi.RSSI(i);
    gWiFiScanResults[i].channel = static_cast<uint8_t>(WiFi.channel(i));
    gWiFiScanResults[i].encryption = static_cast<uint8_t>(WiFi.encryptionType(i));
  }
  gWiFiScanResultCount = cappedCount;
  WiFi.scanDelete();

  if (gAccessPointActive) {
    WiFi.mode(WIFI_AP);
  }

  gWifiScanInProgress = false;
  showStatusLed();
}

bool isTcpClientConnected() {
  return gTcpClientActive && TcpClient.connected();
}

/**
 * @brief Convert user UART settings into Arduino serial config flags.
 * @param settings Requested UART parameters.
 * @param[out] serialConfig Arduino serial framing constant.
 * @retval true Combination is supported.
 * @retval false Combination is invalid or unsupported.
 */
bool mapUartConfig(const UartSettings &settings, uint32_t &serialConfig) {
  if (settings.stopBits != 1 && settings.stopBits != 2) {
    return false;
  }

  switch (settings.dataBits) {
    case 5:
      if (settings.parity == 'N') {
        serialConfig = settings.stopBits == 1 ? SERIAL_5N1 : SERIAL_5N2;
        return true;
      }
      if (settings.parity == 'E') {
        serialConfig = settings.stopBits == 1 ? SERIAL_5E1 : SERIAL_5E2;
        return true;
      }
      if (settings.parity == 'O') {
        serialConfig = settings.stopBits == 1 ? SERIAL_5O1 : SERIAL_5O2;
        return true;
      }
      return false;
    case 6:
      if (settings.parity == 'N') {
        serialConfig = settings.stopBits == 1 ? SERIAL_6N1 : SERIAL_6N2;
        return true;
      }
      if (settings.parity == 'E') {
        serialConfig = settings.stopBits == 1 ? SERIAL_6E1 : SERIAL_6E2;
        return true;
      }
      if (settings.parity == 'O') {
        serialConfig = settings.stopBits == 1 ? SERIAL_6O1 : SERIAL_6O2;
        return true;
      }
      return false;
    case 7:
      if (settings.parity == 'N') {
        serialConfig = settings.stopBits == 1 ? SERIAL_7N1 : SERIAL_7N2;
        return true;
      }
      if (settings.parity == 'E') {
        serialConfig = settings.stopBits == 1 ? SERIAL_7E1 : SERIAL_7E2;
        return true;
      }
      if (settings.parity == 'O') {
        serialConfig = settings.stopBits == 1 ? SERIAL_7O1 : SERIAL_7O2;
        return true;
      }
      return false;
    case 8:
      if (settings.parity == 'N') {
        serialConfig = settings.stopBits == 1 ? SERIAL_8N1 : SERIAL_8N2;
        return true;
      }
      if (settings.parity == 'E') {
        serialConfig = settings.stopBits == 1 ? SERIAL_8E1 : SERIAL_8E2;
        return true;
      }
      if (settings.parity == 'O') {
        serialConfig = settings.stopBits == 1 ? SERIAL_8O1 : SERIAL_8O2;
        return true;
      }
      return false;
    default:
      return false;
  }
}

bool applyUartSettings(const UartSettings &settings) {
  uint32_t serialConfig = SERIAL_8N1;
  if (!mapUartConfig(settings, serialConfig)) {
    return false;
  }

  clearSessionBuffers();
  UartPort.flush();
  UartPort.end();
  UartPort.setRxBufferSize(kUartDriverRxBufferSize);
  UartPort.setTxBufferSize(kUartDriverTxBufferSize);
  UartPort.begin(
      settings.baudRate,
      serialConfig,
      UART1_RX_PIN,
      UART1_TX_PIN,
      false,
      20000UL,
      kUartRxFifoFullThreshold);
  UartPort.setTimeout(0);
  gUartSettings = settings;

  debugPrintf(
      "UART1 reconfigured. Baud=%" PRIu32 ", Data=%u, Parity=%c, Stop=%u\n",
      gUartSettings.baudRate,
      gUartSettings.dataBits,
      gUartSettings.parity,
      gUartSettings.stopBits);
  return true;
}

void addUartSettingsJson(JsonDocument &doc) {
  doc["baudRate"] = gUartSettings.baudRate;
  doc["dataBits"] = gUartSettings.dataBits;
  char parity[2] = {gUartSettings.parity, '\0'};
  doc["parity"] = parity;
  doc["stopBits"] = gUartSettings.stopBits;
}

/**
 * @brief Parse and validate UART settings from HTTP request arguments.
 * @param[out] settings Parsed UART settings when validation succeeds.
 * @param[out] error Human-readable validation error when parsing fails.
 * @retval true Request contains a supported UART framing combination.
 * @retval false Request is missing fields or contains unsupported values.
 */
bool parseUartSettingsFromRequest(UartSettings &settings, String &error) {
  if (!HttpServer.hasArg("baudRate") || !HttpServer.hasArg("dataBits") ||
      !HttpServer.hasArg("parity") || !HttpServer.hasArg("stopBits")) {
    error = "Missing required UART parameters";
    return false;
  }

  const uint32_t baudRate = static_cast<uint32_t>(HttpServer.arg("baudRate").toInt());
  const uint8_t dataBits = static_cast<uint8_t>(HttpServer.arg("dataBits").toInt());
  const String parityArg = HttpServer.arg("parity");
  const uint8_t stopBits = static_cast<uint8_t>(HttpServer.arg("stopBits").toInt());

