Evsdrg/ESP32-wifiUART/src/main.cpp
  if (baudRate < 300) {
    error = "Baud rate must be >= 300";
    return false;
  }

  if (parityArg.length() != 1) {
    error = "Parity must be one of N, E, or O";
    return false;
  }

  settings = {baudRate, dataBits, static_cast<char>(toupper(parityArg[0])), stopBits};
  uint32_t serialConfig = SERIAL_8N1;
  if (!mapUartConfig(settings, serialConfig)) {
    error = "Unsupported UART framing combination";
    return false;
  }

  return true;
}

/**
 * @brief Serve the embedded web configuration page.
 * @route GET /
 */
void handleConfigPage() {
  HttpServer.send(200, "text/html; charset=utf-8", FPSTR(kConfigPageHtml));
}

/**
 * @brief Return current Wi-Fi profile list and network status as JSON.
 * @route GET /api/wifi
 */
void handleGetWiFiProfiles() {
  JsonDocument doc;
  addWiFiProfilesJson(doc);
  sendJsonDocument(200, doc);
}

/**
 * @brief Return current UART runtime settings as JSON.
 * @route GET /api/uart
 */
void handleGetUartSettings() {
  JsonDocument doc;
  addUartSettingsJson(doc);
  sendJsonDocument(200, doc);
}

/**
 * @brief Apply UART settings from HTTP form arguments and return updated state.
 * @route POST /api/uart
 */
void handleSetUartSettings() {
  UartSettings requested = gUartSettings;
  String error;
  if (!parseUartSettingsFromRequest(requested, error)) {
    sendJsonError(400, error);
    return;
  }

  if (!applyUartSettings(requested)) {
    sendJsonError(400, "Failed to apply UART settings");
    return;
  }

  JsonDocument doc;
  addUartSettingsJson(doc);
  sendJsonDocument(200, doc);
}

/**
 * @brief Parse Wi-Fi profile index argument from HTTP request.
 * @param[out] index Parsed profile slot index.
 * @param[out] error Validation error message on failure.
 * @retval true Index exists and is within [0, kMaxWiFiProfiles).
 * @retval false Index is missing or out of range.
 */
bool parseProfileIndexArg(uint8_t &index, String &error) {
  if (!HttpServer.hasArg("index")) {
    error = "Missing profile index";
    return false;
  }

  const int parsed = HttpServer.arg("index").toInt();
  if (parsed < 0 || parsed >= kMaxWiFiProfiles) {
    error = "Profile index out of range";
    return false;
  }

  index = static_cast<uint8_t>(parsed);
  return true;
}

/**
 * @brief Save a Wi-Fi profile and optionally activate it.
 * @details Expects `index` and `ssid`; `password` may be empty to keep existing value.
 * @route POST /api/wifi/save
 */
void handleSaveWiFiProfile() {
  uint8_t index = 0;
  String error;
  if (!parseProfileIndexArg(index, error)) {
    sendJsonError(400, error);
    return;
  }

  if (!HttpServer.hasArg("ssid")) {
    sendJsonError(400, "Missing Wi-Fi name");
    return;
  }

  const String ssid = HttpServer.arg("ssid");
  if (ssid.isEmpty()) {
    sendJsonError(400, "Wi-Fi name cannot be empty");
    return;
  }

  String password = HttpServer.arg("password");
  if (password.isEmpty() && gWiFiProfiles[index].inUse) {
    password = gWiFiProfiles[index].password;
  }

  if (!saveWiFiProfile(index, ssid, password)) {
    sendJsonError(500, "Failed to save Wi-Fi profile");
    return;
  }

  if (HttpServer.arg("activate") == "1") {
    setActiveWiFiProfileIndex(static_cast<int8_t>(index));
    queueWiFiReconfigure();
  }

  JsonDocument doc;
  addWiFiProfilesJson(doc);
  sendJsonDocument(200, doc);
}

/**
 * @brief Mark an existing Wi-Fi profile as active and trigger reconfiguration.
 * @route POST /api/wifi/activate
 */
void handleActivateWiFiProfile() {
  uint8_t index = 0;
  String error;
  if (!parseProfileIndexArg(index, error)) {
    sendJsonError(400, error);
    return;
  }

  if (!gWiFiProfiles[index].inUse || !setActiveWiFiProfileIndex(static_cast<int8_t>(index))) {
    sendJsonError(400, "Selected profile does not exist");
    return;
  }

  queueWiFiReconfigure();
  JsonDocument doc;
  addWiFiProfilesJson(doc);
  sendJsonDocument(200, doc);
}

/**
 * @brief Delete a Wi-Fi profile slot.
 * @details Deleting the active slot schedules a Wi-Fi mode/profile reconfiguration.
 * @route POST /api/wifi/delete
 */
void handleDeleteWiFiProfile() {
  uint8_t index = 0;
  String error;
  if (!parseProfileIndexArg(index, error)) {
    sendJsonError(400, error);
    return;
  }

  if (!gWiFiProfiles[index].inUse) {
    sendJsonError(400, "Selected profile does not exist");
    return;
  }

  const bool deletedActiveProfile = gActiveWiFiProfileIndex == static_cast<int8_t>(index);
  deleteWiFiProfile(index);
  if (deletedActiveProfile) {
    queueWiFiReconfigure();
  }

  JsonDocument doc;
  addWiFiProfilesJson(doc);
  sendJsonDocument(200, doc);
}

/**
 * @brief Perform a nearby Wi-Fi scan and return results as JSON.
 * @route POST /api/wifi/scan
 */
void handleScanWiFi() {
  scanNearbyWiFi();
  JsonDocument doc;
  addWiFiScanResultsJson(doc);
  sendJsonDocument(200, doc);
}

/**
 * @brief Default handler for unknown HTTP routes.
 */
void handleNotFound() {
  sendJsonError(404, "Not found");
}

/**
 * @brief Register HTTP routes and start the web configuration server.
 */
void initHttpServer() {
  HttpServer.on("/", HTTP_GET, handleConfigPage);
  HttpServer.on("/api/wifi", HTTP_GET, handleGetWiFiProfiles);
  HttpServer.on("/api/wifi/scan", HTTP_POST, handleScanWiFi);
  HttpServer.on("/api/wifi/save", HTTP_POST, handleSaveWiFiProfile);
  HttpServer.on("/api/wifi/activate", HTTP_POST, handleActivateWiFiProfile);
  HttpServer.on("/api/wifi/delete", HTTP_POST, handleDeleteWiFiProfile);
  HttpServer.on("/api/uart", HTTP_GET, handleGetUartSettings);
  HttpServer.on("/api/uart", HTTP_POST, handleSetUartSettings);
  HttpServer.onNotFound(handleNotFound);
  HttpServer.begin();
  debugPrintf("HTTP config page listening on port %u\n", kHttpPort);
}

/**
 * @brief Initialize bridge ring buffers for both data directions.
 * @details Allocation prefers PSRAM and falls back to internal SRAM.
 * @retval true Both buffers were allocated successfully.
 * @retval false At least one allocation failed.
 */
bool initBridgeBuffers() {
  const bool tcpToUartReady = gTcpToUartBuffer.begin(kPendingTcpToUartBytes);
  const bool uartToTcpReady = gUartToTcpBuffer.begin(kPendingUartToTcpBytes);

  if (!tcpToUartReady || !uartToTcpReady) {
    gTcpToUartBuffer.release();
    gUartToTcpBuffer.release();
    return false;
  }

  debugPrintf(
      "Bridge buffers ready. TCP->UART=%" PRIu32 " (%s), UART->TCP=%" PRIu32 " (%s)\n",
      static_cast<uint32_t>(gTcpToUartBuffer.capacity()),
      gTcpToUartBuffer.usingPsram() ? "PSRAM" : "SRAM",
      static_cast<uint32_t>(gUartToTcpBuffer.capacity()),
      gUartToTcpBuffer.usingPsram() ? "PSRAM" : "SRAM");
  return true;
}

bool isNetworkReady() {
  return gAccessPointActive || WiFi.status() == WL_CONNECTED;
}

void markActivity() {
  gLastActivityAtMs = millis();
}

void showStatusLed() {
  const bool wifiConnected = WiFi.status() == WL_CONNECTED;
  const bool accessPointActive = gAccessPointActive;
  const bool tcpClientConnected = isTcpClientConnected();
  const bool wifiScanInProgress = gWifiScanInProgress;

  CRGB baseColor = CRGB::Red;
  if (tcpClientConnected) {
    baseColor = CRGB::Purple;
  } else if (wifiConnected) {
    baseColor = CRGB::Green;
  } else if (accessPointActive) {
    baseColor = CRGB::Orange;
  }

  const uint32_t activityAgeMs = millis() - gLastActivityAtMs;
  const bool inActivityWindow = activityAgeMs <= kActivityFlashWindowMs;
  const bool firstPulse = activityAgeMs < kActivityPulseMs;
  const bool secondPulse =
      activityAgeMs >= (kActivityPulseMs + kActivityPulseGapMs) &&
      activityAgeMs < (2 * kActivityPulseMs + kActivityPulseGapMs);
  const bool scanBlinkOn = (millis() / 180) % 2 == 0;

  if (wifiScanInProgress) {
    Leds[0] = scanBlinkOn ? CRGB::Green : CRGB::Black;
  } else if (inActivityWindow) {
    Leds[0] = (firstPulse || secondPulse) ? CRGB::Blue : CRGB::Black;
  } else {
    Leds[0] = baseColor;
  }

  FastLED.show();
}

void stopTcpServer() {
  if (!gTcpServerStarted) {
    return;
  }

  TcpServer.end();
  gTcpServerStarted = false;
}

void clearSessionBuffers() {
  gTcpToUartBuffer.clear();
  gUartToTcpBuffer.clear();
}

void disconnectTcpClient(const char *reason) {
  const bool hadSession = gTcpClientActive;
  TcpClient.stop();
  gTcpClientActive = false;
  if (hadSession) {
    ++gTcpClientDisconnectCount;
  }
  debugPrintf("TCP client disconnected: %s\n", reason);
}

void startTcpServer() {
  if (gTcpServerStarted || !isNetworkReady()) {
    return;
  }

  TcpServer.begin();
  TcpServer.setNoDelay(true);
  gTcpServerStarted = true;
  debugPrintf("TCP bridge listening on port %d\n", TCP_BRIDGE_PORT);
}

void logStationReady() {
  debugPrintf(
      "STA mode ready. IP: %s, TCP port: %d\n",
      WiFi.localIP().toString().c_str(),
      TCP_BRIDGE_PORT);
}

void startAccessPoint() {
  gUseStationMode = false;
  gAccessPointActive = false;
  WiFi.mode(WIFI_AP);

  if (!WiFi.softAP(AP_SSID, AP_PASSWORD)) {
    debugPrintln("Failed to start WiFi AP");
    return;
  }

  gAccessPointActive = true;
  debugPrintf(
      "AP mode ready. SSID: %s, password: %s, IP: %s, TCP port: %d\n",
      AP_SSID,
      AP_PASSWORD,
      WiFi.softAPIP().toString().c_str(),
      TCP_BRIDGE_PORT);
}

void stopStationBeforeAccessPoint() {
  gUseStationMode = false;
  gStationWasConnected = false;
  WiFi.setAutoReconnect(false);
  WiFi.disconnect(false, false);
  delay(100);
  WiFi.mode(WIFI_MODE_NULL);
  delay(100);
}

/**
 * @brief Switch Wi-Fi to STA mode and start connecting with active profile.
 * @note Existing TCP session is dropped because network context changes.
 */
void startStationMode() {
  const WiFiProfile *activeProfile = getActiveWiFiProfile();
  if (activeProfile == nullptr) {
    debugPrintln("No active Wi-Fi profile, unable to enter STA mode");
    return;
  }

  gUseStationMode = true;
  gAccessPointActive = false;
  gStationWasConnected = false;
  stopTcpServer();
  if (gTcpClientActive) {
    disconnectTcpClient("wifi profile change");
  }
  WiFi.disconnect(true, true);
  delay(100);
  WiFi.mode(WIFI_STA);
  WiFi.setAutoReconnect(true);
  WiFi.begin(activeProfile->ssid.c_str(), activeProfile->password.c_str());
  gLastWifiReconnectAttemptMs = millis();
  debugPrintf("Connecting to WiFi SSID: %s\n", activeProfile->ssid.c_str());
}

/**
 * @brief Block during boot for initial STA connection attempt.
 * @details If timeout expires, firmware falls back to AP mode and starts TCP service there.
 */
void waitForInitialStationConnection() {
  const uint32_t startMs = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - startMs < kWifiConnectTimeoutMs) {
    delay(250);
    debugPrint(".");
    showStatusLed();
  }
  debugPrintln("");

  if (WiFi.status() == WL_CONNECTED) {
    gStationWasConnected = true;
    ++gWifiReconnectCount;
    logStationReady();
    startTcpServer();
  } else {
    debugPrintln("Initial WiFi connect timed out, falling back to AP mode");
    stopStationBeforeAccessPoint();
    startAccessPoint();
    startTcpServer();
  }
}

void handleStationMode() {
  if (!gUseStationMode) {
    return;
  }

  const bool connected = WiFi.status() == WL_CONNECTED;
  if (connected && !gStationWasConnected) {
    gStationWasConnected = true;
    ++gWifiReconnectCount;
    logStationReady();
    startTcpServer();
  }

  if (!connected && gStationWasConnected) {
    gStationWasConnected = false;
    debugPrintln("WiFi disconnected");
    stopTcpServer();
    if (gTcpClientActive) {
      disconnectTcpClient("wifi lost");
    }
  }

  if (!connected && millis() - gLastWifiReconnectAttemptMs >= kWifiReconnectIntervalMs) {
    debugPrintln("Retrying WiFi connection");
    if (!WiFi.reconnect()) {
      const WiFiProfile *activeProfile = getActiveWiFiProfile();
      if (activeProfile != nullptr) {
        WiFi.disconnect(false, false);
        WiFi.begin(activeProfile->ssid.c_str(), activeProfile->password.c_str());
      }
    }
    gLastWifiReconnectAttemptMs = millis();
  }
}

/**
 * @brief Apply deferred Wi-Fi mode/profile changes requested by HTTP handlers.
 * @details Runs in loop context to keep request callbacks short and side effects centralized.
 */
void applyPendingWiFiReconfigureIfNeeded() {
  if (!gPendingWiFiReconfigure) {
    return;
  }

  gPendingWiFiReconfigure = false;
  if (getActiveWiFiProfile() != nullptr) {
    startStationMode();
    waitForInitialStationConnection();
    return;
  }

  stopTcpServer();
  if (gTcpClientActive) {
    disconnectTcpClient("wifi profile removed");
  }
  stopStationBeforeAccessPoint();
  startAccessPoint();
  startTcpServer();
}

