Evsdrg/ESP32-wifiUART/src/main.cpp
void acceptClientIfNeeded() {
  if (!gTcpServerStarted) {
    return;
  }

  if (gTcpClientActive && !TcpClient.connected()) {
    disconnectTcpClient("peer closed");
  }

  if (isTcpClientConnected()) {
    return;
  }

  WiFiClient newClient = TcpServer.accept();
  if (!newClient) {
    return;
  }

  newClient.setNoDelay(true);
  TcpClient = newClient;
  gTcpClientActive = true;
  ++gTcpClientConnectCount;
  debugPrintf("TCP client connected: %s\n", TcpClient.remoteIP().toString().c_str());
}

/**
 * @brief Drain incoming TCP bytes into the TCP->UART ring buffer.
 * @note Overflow events are counted when socket input outruns UART consumption.
 */
void pullTcpIntoBuffer() {
  if (!isTcpClientConnected()) {
    return;
  }

  uint8_t buffer[kIoChunkSize];
  while (TcpClient.available() > 0 && gTcpToUartBuffer.freeSpace() > 0) {
    const size_t requestSize = min(
        static_cast<size_t>(TcpClient.available()),
        min(sizeof(buffer), gTcpToUartBuffer.freeSpace()));
    const int readSize = TcpClient.read(buffer, requestSize);
    if (readSize <= 0) {
      break;
    }

    gTcpToUartBuffer.push(buffer, static_cast<size_t>(readSize));
    markActivity();
  }

  if (TcpClient.available() > 0 && gTcpToUartBuffer.freeSpace() == 0) {
    ++gTcpToUartOverflowEvents;
  }
}

/**
 * @brief Flush buffered TCP payload to UART while respecting TX headroom.
 */
void flushTcpBufferToUart() {
  if (gTcpToUartBuffer.size() == 0) {
    return;
  }

  const int uartWriteSpace = UartPort.availableForWrite();
  if (uartWriteSpace <= 0) {
    return;
  }

  uint8_t buffer[kIoChunkSize];
  while (gTcpToUartBuffer.size() > 0) {
    const int availableSpace = UartPort.availableForWrite();
    if (availableSpace <= 0) {
      break;
    }

    const size_t chunkSize = min(
        gTcpToUartBuffer.size(),
        min(sizeof(buffer), static_cast<size_t>(availableSpace)));
    gTcpToUartBuffer.peek(buffer, chunkSize);
    const size_t written = UartPort.write(buffer, chunkSize);
    if (written == 0) {
      break;
    }

    gTcpToUartBuffer.discard(written);
    gTcpToUartBytes += written;
    markActivity();
  }
}

/**
 * @brief Read UART RX bytes into the UART->TCP ring buffer.
 * @warning Continuous sender pressure can drop bytes when buffer remains full.
 */
void pullUartIntoBuffer() {
  uint8_t buffer[kIoChunkSize];
  while (UartPort.available() > 0 && gUartToTcpBuffer.freeSpace() > 0) {
    const size_t requestSize = min(
        static_cast<size_t>(UartPort.available()),
        min(sizeof(buffer), gUartToTcpBuffer.freeSpace()));
    const size_t readSize = UartPort.readBytes(buffer, requestSize);
    if (readSize == 0) {
      break;
    }

    gUartToTcpBuffer.push(buffer, readSize);
    markActivity();
  }

  if (UartPort.available() > 0 && gUartToTcpBuffer.freeSpace() == 0 &&
      millis() - gLastUartBackpressureLogAtMs >= kUartBackpressureLogIntervalMs) {
    ++gUartBackpressureEvents;
    ++gUartToTcpOverflowEvents;
    gLastUartBackpressureLogAtMs = millis();
    debugPrintf(
        "Warning: UART backlog full (%" PRIu32 " bytes pending). Data loss is possible if the sender keeps streaming.\n",
        static_cast<uint32_t>(kPendingUartToTcpBytes));
  }
}

/**
 * @brief Flush buffered UART payload to the active TCP client.
 * @note Partial TCP writes are tracked for throughput diagnostics.
 */
void flushUartBufferToTcp() {
  if (!isTcpClientConnected() || gUartToTcpBuffer.size() == 0) {
    return;
  }

  uint8_t buffer[kIoChunkSize];
  while (isTcpClientConnected() && gUartToTcpBuffer.size() > 0) {
    if (!TcpClient.connected()) {
      disconnectTcpClient("peer reset before write");
      break;
    }

    const size_t chunkSize = min(gUartToTcpBuffer.size(), sizeof(buffer));
    gUartToTcpBuffer.peek(buffer, chunkSize);
    const size_t written = TcpClient.write(buffer, chunkSize);
    if (written == 0) {
      if (!TcpClient.connected()) {
        disconnectTcpClient("peer reset during write");
      }
      break;
    }

    if (written < chunkSize) {
      ++gTcpPartialWriteEvents;
    }

    gUartToTcpBuffer.discard(written);
    gUartToTcpBytes += written;
    markActivity();
  }
}

void logBridgeStatsIfNeeded() {
  if (millis() - gLastStatsLogAtMs < kStatsLogIntervalMs) {
    return;
  }

  gLastStatsLogAtMs = millis();
  debugPrintf(
      "Stats: wifi=%s tcp=%s uart->tcp=%" PRIu64 " tcp->uart=%" PRIu64 " pending(u2t/t2u)=%" PRIu32 "/%" PRIu32 " tcp_conn=%" PRIu32 " tcp_disc=%" PRIu32 " wifi_reconn=%" PRIu32 " uart_backpressure=%" PRIu32 " uart_overflow=%" PRIu32 " tcp_overflow=%" PRIu32 " tcp_partial=%" PRIu32 "\n",
      WiFi.status() == WL_CONNECTED ? "up" : "down",
      isTcpClientConnected() ? "up" : "down",
      static_cast<uint64_t>(gUartToTcpBytes),
      static_cast<uint64_t>(gTcpToUartBytes),
      static_cast<uint32_t>(gUartToTcpBuffer.size()),
      static_cast<uint32_t>(gTcpToUartBuffer.size()),
      gTcpClientConnectCount,
      gTcpClientDisconnectCount,
      gWifiReconnectCount,
      gUartBackpressureEvents,
      gUartToTcpOverflowEvents,
      gTcpToUartOverflowEvents,
      gTcpPartialWriteEvents);
}

}  // namespace

void setup() {
  if constexpr (kEnableDebugLogs) {
    Serial.begin(kDebugBaudRate);
  }
  if (!initPreferences()) {
    debugPrintln("Failed to initialize Preferences. Restarting in 2 seconds.");
    delay(2000);
    ESP.restart();
  }

  if (!initBridgeBuffers()) {
    debugPrintln("Failed to allocate bridge buffers. Restarting in 2 seconds.");
    delay(2000);
    ESP.restart();
  }

  if (!applyUartSettings(gUartSettings)) {
    debugPrintln("Failed to initialize UART1. Restarting in 2 seconds.");
    delay(2000);
    ESP.restart();
  }

  FastLED.addLeds<WS2812, kLedPin, GRB>(Leds, kLedCount);
  FastLED.setBrightness(kLedBrightness);
  showStatusLed();

  WiFi.setSleep(false);
  if (getActiveWiFiProfile() != nullptr) {
    startStationMode();
    waitForInitialStationConnection();
  } else {
    startAccessPoint();
    startTcpServer();
  }
  initHttpServer();
  gLastStatsLogAtMs = millis();

  debugPrintf(
      "UART1 bridge ready. RX=%d, TX=%d, Baud=%" PRIu32 ", %u%c%u\n",
      UART1_RX_PIN,
      UART1_TX_PIN,
      gUartSettings.baudRate,
      gUartSettings.dataBits,
      gUartSettings.parity,
      gUartSettings.stopBits);
}

void loop() {
  handleStationMode();
  if (!gUseStationMode) {
    startTcpServer();
  }

  HttpServer.handleClient();
  applyPendingWiFiReconfigureIfNeeded();
  acceptClientIfNeeded();
  pullTcpIntoBuffer();
  flushTcpBufferToUart();
  pullUartIntoBuffer();
  flushUartBufferToTcp();
  logBridgeStatsIfNeeded();
  showStatusLed();
  delay(1);
}
